const dictionary = {
    "алгоритм": "Алгоритм - це набір інструкцій, які описують порядок дій виконавця, щоб досягти результату розв'язання задачі за скінченну кількість дій; система правил виконання дискретного процесу, яка досягає поставленої мети за скінченний час. Для візуалізації алгоритмів часто використовують блок-схеми.",
    "генна інженерія": "Генна інженерія - це біотехнологічна сукупність прийомів, методів і технологій одержання рекомбінантних РНК і ДНК, виділення генів з організму (клітин), здійснення маніпуляцій з генами і введення їх в інші організми.",
    "рибонуклеїнова кислота": "Рибонуклеїнова кислота, РНК - клас нуклеїнових кислот, лінійних полімерів нуклеотидів, до складу яких входять залишок фосфорної кислоти, рибоза (на відміну від ДНК, що містить дезоксирибозу) і азотисті основи — аденін, цитозин, гуанін і урацил (на відміну від ДНК, що замість урацила містить тимін).",
    "дезоксирибонуклеїнова кислота": "Дезоксирибонуклеїнова кислота, ДНК - один із двох типів природних нуклеїнових кислот, що забезпечує зберігання, передачу з покоління в покоління і реалізацію генетичної програми розвитку й функціонування живих організмів.",
    "нейронна мережа": "Нейронна мережа - це математична модель, що працює за принципом людського мозку. Вона навчається шляхом первинного опрацювання великого набору даних, не вимагаючи написання окремого коду під конкретне завдання."
  };
  
  function validateInput() {
    const word = document.querySelector("input[name='word']").value;
    if (word === "") {
      alert("Введіть слово!");
      return false;
    }
    if (!isNaN(word)) {
      alert("Слово не повинно бути числом!");
      return false;
    }
    return true;
  }
  
  function searchWord() {
    const word = document.querySelector("input[name='word']").value;
    const meaning = dictionary[word];
    if (meaning) {
      document.querySelector("#meaning").textContent = meaning;
    } else {
      document.querySelector("#meaning").textContent = "Слово не знайдено";
    }

  document.querySelector("input[name='word']").value = "";
  }
  
  document.querySelector("form").addEventListener("submit", (event) => {
    event.preventDefault();
    if (!validateInput()) {
      return;
    }
    searchWord();
  });


